openfoam-bridge/templates/pritchard-cascade-3d/system/fvSchemes
FoamFile {version 2.0; format ascii; class dictionary; object fvSchemes;}

ddtSchemes {default steadyState;}
gradSchemes {default cellLimited Gauss linear 1;}
divSchemes {default none; div(phi,U) bounded Gauss upwind; div(phi,h) bounded Gauss upwind;
 div(phi,K) bounded Gauss upwind; div(phi,k) bounded Gauss upwind; div(phi,omega) bounded Gauss upwind;
 div(phid,p) Gauss upwind; div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;}
laplacianSchemes {default Gauss linear limited 0.5;}
interpolationSchemes {default linear;} snGradSchemes {default limited 0.5;}
wallDist {method meshWave;} fluxRequired {default no; p;}
